"TIL a sheep in New Zealand avoided being caught and shorn by hiding in caves for 6 years. When finally found, his fleece contained enough wool to make 20 large men's suits.""TIL that the Canadian province of Manitoba, fed up with Ontario laws restricting the cross-provincial sale of eggs, copied the Ontario laws, sued itself all the way up to the Supreme Court, and got those laws deemed unconstitutional in ALL provinces.""TIL The USS Niagara was intentionally sunk in 1820 for preservation, and raised 93 years later for restoration.""TIL Monty Python put out a \"three-sided\" comedy record that would have completely different material depending on where you started the record. It was mastered with two grooves on the second side and no track listing so when people played it they would be surprised to find new material""TIL Pink Floyd's Atom Heart Mother has an essentially infinite runtime. The final track Alan's Psychedelic Breakfast ends with the sound of a dripping faucet etched into a run off grove that never resolves and will play until the listener stops the record.""TIL Color Blind people can see the differences in texture and brightness more intensely than normal people and were even used in WWII to spot camouflage.""TIL that, in the original Cinderella, the Fairy Godmother is in fact a cynical device to show that while you may have intelligence, grace and charm, you will never succeed without the right connections""TIL New York City has entire fake buildings that act as vents for the underground subway""TIL The common swift holds the record for the longest continuous flight time. A study of 19 swifts showed the birds stay in flight for 10 months out of the year. Three of the birds did not rest once, staying in flight for 300 days straight.""TIL that Agatha Christie is the best-selling novelist of all time (2 billion books sold), and her estate claims she ranks 3rd overall, behind Shakespeare's works and the Bible. She is the most-translated author with works in at least 103 languages. \"And Then There Were None\" is her best selling book""TIL a gannet named Nigel, was dubbed \"the loneliest bird in the world\" due to the absence of any other birds of his species on his island. Conservationists built fake concrete birds to attract more birds but Nigel ended up falling in love with one the decoys.""TIL about the Look-and-say sequence, an incremental pattern generated from counting the number of consecutive digits in groups of the same digit.""TIL that roughly one out of every three socks you wear was made in a place known as “Sock City”. A small Chinese village in the 1980s it has grown to employ over 100,000 people and produces 8 billion socks a year.""TIL Stirling Colgate, heir to the Colgate toothpaste family fortune, was a physicist who proposed the use of satellites for detection of nuclear weapons testing. He went on to conduct research that helped Chandrasekhar win a Nobel Prize after realizing that the satellites were detecting supernovae.""TIL Vanna White, the letter presser lady on Wheel of Fortune makes 8 million a year. Her net worth is 140 million.""TIL that cashews grow out of the bottom of a fruit called a cashew apple. Even though the apple is edible, it's usually just the cashew itself that is eaten, while the apple is thrown out or eaten locally.""TIL Aimo Koivunen, a Finnish soldier who during WW2, over-dosed on amphetamines, lost his squad, laid in a ditch for a week after stepping on a land mine, then travelled over 250 miles on skis, was found alive only weighing 94 pounds. He went on to live another 45 years.""TIL: William Brewster, leader of the Plymouth Colony in America, named his children Jonathan, Patience, Fear, Love, and Wrestling.""TIL members of Lewis &amp; Clark's expedition took mercury-bearing pills to \"treat\" constipation and other conditions, and thus left mercury deposits wherever they dug their latrines. These mercury signals have been used to pinpoint some of the 600 camps on the voyage.""TIL the Norse did scientific observations in America, measuring the hours of the day at Winter Solstice at 9 hrs. This matches Mount Hope Bay, Massachusetts, according to historian Carl Rafn.""TIL that Tatiana and Krista Hogan are conjoined twins of the brain and can see through eachothers eyes and read eachothers minds.""TIL In-n-Out Burger Store managers make 160K a year""TIL a mobile Diablo game was an actual April Fool's joke four years ago""TIL Johnny Cash started a forest fire in California that burned over 500 acres. When questioned by a judge, he said, “I didn't do it, my truck did, and it's dead, so you can't question it”.""TIL Our solar system is closer to the center of the Canis Major Dwarf Galaxy than it is to the center of the Milky Way."